tests/specialized/load/artillery-config.yml
# GENESIS LUMINAL - LOAD TESTING CONFIGURATION
# Configuração de testes de carga usando Artillery
# Baseado na capacidade real da aplicação

config:
  target: 'http://localhost:3000'  # Backend API
  phases:
    # Warm-up suave
    - duration: 30
      arrivalRate: 1
      name: "Warm-up phase"
    
    # Carga normal - baseada na capacidade esperada
    - duration: 120
      arrivalRate: 5
      name: "Normal load"
    
    # Pico de carga
    - duration: 60
      arrivalRate: 15
      name: "Peak load"
    
    # Stress test
    - duration: 30
      arrivalRate: 25
      name: "Stress test"

  # Configurações de timeout baseadas na latência real (5ms + buffer)
  timeout: 10
  
  # Métricas customizadas
  processor: "./load-test-processor.js"

scenarios:
  - name: "Health check endpoints"
    weight: 30
    flow:
      - get:
          url: "/health"
      - get:
          url: "/api/v1/health"

  - name: "Emotional analysis API"
    weight: 70
    flow:
      - post:
          url: "/api/v1/analyze"
          json:
            text: "Experiência transcendental incrível"
            intensity: 0.8
            context: "genesis_luminal"
          capture:
            - json: "$.emotionalProfile.dominant"
              as: "dominantEmotion"
      - think: 1

# Critérios de sucesso baseados na performance real
expect:
  # 95% das requests devem ser bem-sucedidas
  - statusCode: 200
    
  # Latência baseada nos 5ms reais + overhead de rede
  - contentType: json
  - maxErrorRate: 0.05  # 5% de erro máximo
  - p95: 100  # 95% das requests em menos de 100ms
  - p99: 250  # 99% das requests em menos de 250ms